money = 1000.00

products = {
    "หมูสับกิโล": 150.00,
    "เนื้ออกไก่": 105.00,
    "ไก่บ้าน(ตัว)": 120.00,
    "มาม่าต้มยำ": 6.50,
    "ข้าวสาร": 150.00,
    "น้ำตาล": 20.00,
    "ปลากะป๋องสามแม่ครัว": 10.00,
    "ซอสน้ำมันหอย": 18.00,
    "ผงชูรส": 10.25,
    "ไข่แผงคละเบอร์": 120.25,
    "ชาเขียว": 21.50,
    "Pepsi": 29.50,
    "กาแฟ": 15.75,
    "ขนมปังอบเนย": 19.00,
    "ชาไทย": 11.50,
    "น้ำเปล่า": 15.15,
    "น้ำแข็ง": 10.00
}

selected_items = [
    "หมูสับกิโล",
    "เนื้ออกไก่",
    "ไก่บ้าน(ตัว)",
    "มาม่าต้มยำ",
    "ข้าวสาร",
    "น้ำตาล",
    "ปลากะป๋องสามแม่ครัว",
    "ซอสน้ำมันหอย",
    "ผงชูรส",
    "ไข่แผงคละเบอร์",
    "ชาเขียว",
    "Pepsi",
    "กาแฟ",
    "ขนมปังอบเนย",
    "ชาไทย"
]

if len(selected_items) < 15:
    print("ต้องเลือกสินค้าจำนวนอย่างน้อย 15 รายการ")
else:
    total_cost = 0
    for item in selected_items:
        total_cost += products[item]

    change = money - total_cost

    print("รายการสินค้าที่นักเรียนซื้อ:")
    for item in selected_items:
        print(f"- {item}: {products[item]:.2f} บาท")

    print("\nสรุปผลการซื้อของ")
    print(f"จำนวนสินค้าที่ซื้อ: {len(selected_items)} รายการ")
    print(f"ใช้เงินไปทั้งหมด: {total_cost:.2f} บาท")

    if total_cost > money:
        print(f"❌ เกินงบ! ขาดเงินอีก {-change:.2f} บาท")
    else:
        print(f"✅ เงินทอน: {change:.2f} บาท")
